package Day05;
public class Day05_별문제연습 {
public static void main(String[] args) {
	
   
       
       //for 으로 별찍기
       //별1) 입력받은 정수만큼 별 출력 
       System.out.println("\n------------------");

       //별2) 입력받은 정수만큼 별 출력[* 5개마다 줄바꿈] 
       System.out.println("\n------------------");
       
       /*별3) 입력받은 줄만큼 출력 [for 중첩]
       
       	*		
       	**		
       	***		
       	****	
       	*****
       	
        */
       System.out.println("\n------------------");
    	   
       
       /*별4) 입력받은 줄만큼 출력
        *****	
        ****	
        ***		
        **		
        * 
        
        */
      
       System.out.println("\n------------------");
       
       
       
       
       /*별5) 입력받은 줄만큼 출력 [ for 3번 ] 
        									
	    *	
       **	
      ***	
     ****	
	*****
        */
     
       System.out.println("\n------------------");
    	      
    	      
    	
       
       /*별6) 입력받은 줄만큼 출력 
         *****	
          ****	
           ***	
            **	
             *	
        */
      
       System.out.println("\n------------------");
      
      
      
      /*별7) 입력받은 줄만큼 출력
       	*		
       ***		
	  *****		
	 *******	
	*********
       */
       System.out.println("\n------------------");
       
      
      
     /*별8) 입력받은 줄만큼 출력
        1
       222
      33333
     4444444
      */
       System.out.println("\n------------------");
     
       
     /*별9) 입력받은 줄만큼 출력
    *********	
	 *******	
	  *****		
	   ***		
	    *	
      */
       System.out.println("\n------------------");
      
       
       /*별10) 입력받은 줄만큼 출력
        *
       ***
      *****
	 *******
	*********
	 *******
	  *****
	   ***
	    *
	    
        */
       System.out.println("\n------------------");
      
       
       /*별11) 입력받은 줄만큼 출력 [ 입력받은 행/열 동일 ] 
    *     *		
	 *   *		
	  * *		
	   *		
      * *		
     *   *		
    *     *	
       
        */
       System.out.println("\n------------------");
       
       
       
      
       /*별문제12 : 입력받은 줄만큼 출력
    *        *
	**      **
	***    ***
	****  ****
	**********
	****  ****
	***    ***
	**      **
	*        *
        */
       System.out.println("\n------------------");
       
       
       
      
       
       /*별문제13 : 입력받은 줄만큼 출력
                       *                        
                      * *                       
                     *****                      
                    *     *                     
                   * *   * *                    
                  ***** *****                   
                 *           *                  
                * *         * *                 
               *****       *****                
              *     *     *     *               
             * *   * *   * *   * *              
            ***** ***** ***** *****             
           *                       *            
          * *                     * *           
         *****                   *****          
        *     *                 *     *         
       * *   * *               * *   * *        
      ***** *****             ***** *****       
     *           *           *           *      
    * *         * *         * *         * *     
   *****       *****       *****       *****    
  *     *     *     *     *     *     *     *   
 * *   * *   * *   * *   * *   * *   * *   * *  
***** ***** ***** ***** ***** ***** ***** *****	   
        */
       System.out.println("\n------------------");  
       
       
       
}
}

